tap "hashicorp/tap"
tap "jesseduffield/lazygit"

brew "asdf"
brew "autoconf"
brew "carapace"
brew "cmake"
brew "hashicorp/tap/terraform"
brew "terragrunt"
brew "trash"
brew "neovim"
brew "ripgrep"
brew "nvm"
brew "python"
brew "rbenv"
brew "direnv"
brew "fd"
brew "fop"
brew "git"
brew "jesseduffield/lazygit/lazygit"
brew "tig"
brew "thefuck"
brew "saml2aws"
brew "bundler-completion" 
brew "docker-completion"
brew "gem-completion"
brew "launchctl-completion"
brew "libpq"
brew "libxslt"
brew "imagemagick"
brew "openssl"
brew "pip-completion"
brew "pngpaste"
brew "rails-completion"
brew "rake-completion"
brew "ruby-completion"
brew "starship"
brew "stow"
brew "tmuxinator"
brew "tmuxinator-completion"
brew "wxwidgets"

cask "iterm2"
cask "amethyst"
cask "font-meslo-lg-nerd-font"
cask "ghostty"

