tap "hashicorp/tap"
tap "jesseduffield/lazygit"

brew "7-Zip"
brew "aider"
brew "asdf"
brew "autoconf"
brew "bat"
brew "bundler-completion" 
brew "carapace"
brew "cmake"
brew "direnv"
brew "docker-completion"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "fop"
brew "fzf"
brew "gem-completion"
brew "git"
brew "gnupg"
brew "imagemagick"
brew "jesseduffield/lazygit/lazygit"
brew "jq"
brew "hashicorp/tap/terraform"
brew "launchctl-completion"
brew "libpq"
brew "libxslt"
brew "markdownlint-cli2"
brew "neovim"
brew "nvm"
brew "openssl"
brew "pip-completion"
brew "pngpaste"
brew "pnpm"
brew "poppler"
brew "pre-commit"
brew "python"
brew "rails-completion"
brew "rake-completion"
brew "rbenv"
brew "resvg"
brew "rg"
brew "ripgrep"
brew "ruby-build"
brew "ruby-completion"
brew "saml2aws"
brew "starship"
brew "stow"
brew "terragrunt"
brew "tig"
brew "thefuck"
brew "tmuxinator"
brew "tmuxinator-completion"
brew "trash"
brew "xan"
brew "yazi"
brew "zoxide"

cask "amethyst"
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "iterm2"
cask "pgadmin4"

